Repository: Fatih20/ValaSimpleHTTPServer
Catalog: po/*.po
Languages: ca, fr

source: Server is listening on:
ca: Servidor escoltant a:
fr: Le serveur est en écoute sur :

source: Share your files
ca: Comparteix els teus fitxers
fr: Partagez vos fichiers

source: Select a folder and start sharing
ca: Selecciona una carpeta i comença a compartir
fr: Sélectionnez un dossier et commencez à partager

source: Open
ca: Obrir
fr: Ouvrir

source: Browse to select a folder
ca: Navega per seleccionar una carpeta
fr: Parcourir pour sélectionner un dossier

source: Select packages to install
ca: Selecciona paquets a instaŀlar
fr: Sélectionner les paquets à installer

source: Cancel
ca: Canceŀlar
fr: Annuler

source: Your files are at
ca: Els teus fitxers estan a
fr: Vos fichiers son situés dans

source: Settings
ca: Configuració
fr: Paramètres

source: Listening at port:
ca: Escoltant al port:
fr: A l'écoute du port :

source: Simple File Server
fr: Simple serveur de fichiers

source: Listening on:
ca: Escoltant a:
fr: A l'écoute sur :

source: Requested: %s, full path: %s
fr: Demandé : %s, chemin complet : %s

source: %s<h1>Listing files of: %s</h1>
ca: %s<h1>Llistant fitxers de: %s</h1>
fr: %s<h1>Liste des fichiers de : %s</h1>

source: Open an http server in the selected folder and share your files.
ca: Obre un servidor http en el directori seleccionat i comparteix els teus fitxers.
fr: Ouvrez un serveur HTTP dans le dossier sélectionné et partagez vos fichiers.

source: app;vala;share;files;server;http;
fr: application;vala;partager;fichiers;serveur;http;

source: Acces to your files from any device in the same network
ca: Accedeix als teus fitxers desde qualsevol dispositiu a la mateixa xarxa
fr: Accédez à vos fichiers depuis n'importe quel appareil du même réseau

source: VServer opens an http server in the desired folder. Very usefull to share files in a easy and fast way. Do you have a film in the computer and you want to watch it on the mobile phone? Just start Vserver in you computer and go to the given link with the mobile phone, you will have the film right there!
ca: VServer obre un servidor http en el directori desitjat. És molt útil per compartir fitxers de una manera fàcil i ràpida. Tens una pelicula al ordinador peró vols mirar-la desde el móbil? Simplement obre VServer al ordinador i accedeix a la película desde el móbil!
fr: VServer ouvre un serveur http dans le dossier souhaité. Très utile pour partager des fichiers de manière simple et rapide. Vous avez un film dans l'ordinateur et vous voulez le regarder sur votre téléphone portable ? Il suffit de démarrer Vserver dans votre ordinateur et d'aller au lien donné avec le téléphone portable, vous aurez le film juste là !

source: It has been developed to follow the same behaviour than the wellknown python's simpleHTTPserver.
ca: S'ha desenvolupat imitant el comportament del famos simpleHTTPserver de python.
fr: Il a été développé pour suivre le même comportement que le simple serveur HTTP reconnu de Python.

source: It also works throught comand line options. Try typing 'com.github.bcedu.valasimplehttpserver --help' to learn more.
ca: També està disponible desde la linia de comandes. Prova executant 'com.github.bcedu.valasimplehttpserver --help' per més informació.
fr: Il fonctionne également grâce aux options de ligne de commande. Essayez de taper'com.github.bcedu.valasimplehttpserver --help' pour en savoir plus.

source: VServer release
fr: Version intiale de VServer

source: Make app translatable.
fr: L'application peut maintenant être traduite.

source: Add Catalan translations.
fr: Ajout des traductions en Catalan.

source: Add French translations.
fr: Ajout des traductions françaises.

source: Start an http server through a clean and minimalist gui.
ca: Engega un servidor http a través de una interficie minimalista i senzilla.
fr: Démarrez un serveur HTTP via une interface épurée et minimaliste.

source: Use the command line options to start an http server through the console (type "com.github.bcedu.valasimplehttpserver --help" to learn more).
ca: Utilitza la linia de comandes per iniciar un servidor http (executa "com.github.bcedu.valasimplehttpserver --help" per més informació).
fr: Utilisez les options de ligne de commande pour démarrer un serveur HTTP via la console (tapez "com.github.bcedu.valasimplehttpserver --help" pour en savoir plus).

source: Choose the port where vserver listens through the gui.
ca: Tria el port on escoltarà a través de la aplicació
fr: Choisissez le port où VServer écoute via l'interface graphique.

source: Initial 1.0.2 release!
fr: Version 1.0.2 initiale !
